privileged_person_day_care_cost = 0.78
unprivileged_person_day_care_cost = 1.30


full_weekday_names = {
    'пн': ('Понедельник', 1),
    'вт': ('Вторник', 2),
    'ср': ('Среда', 3),
    'чт': ('Четверг', 4),
    'пт': ('Пятница', 5)
}

correct_month_names = {
    1: "январе",
    2: "феврале",
    3: "марте",
    4: "апреле",
    5: "мае",
    6: "июне",
    7: "июле",
    8: "августе",
    9: "сентябре",
    10: "октябре",
    11: "ноябре",
    12: "декабре"
}

holidays_2022 = ((7,),  # Январь
                 (0,),  # Февраль
                 (8,),  # Март
                 (0,),  # Апрель
                 (3, 9),  # Май
                 (0,),  # Июнь
                 (0,),  # Июль
                 (0,),  # Август
                 (0,),  # Сентрябрь
                 (0,),  # Октябрь
                 (7,),  # Ноябрь
                 (0,))  # Декабрь

holidays_2023 = ((2,),  # Январь
                 (0,),  # Февраль
                 (8,),  # Март
                 (25,),  # Апрель
                 (1, 9),  # Май
                 (0,),  # Июнь
                 (3,),  # Июль
                 (0,),  # Август
                 (0,),  # Сентябрь
                 (0,),  # Октябрь
                 (7,),  # Ноябрь
                 (25,))  # Декабрь
